{"rss":{"channel":{"title":"US-CERT Alerts","link":["https://www.us-cert.gov/ncas/alerts.xml",{"_href":"https://www.us-cert.gov/ncas/alerts.xml","_rel":"self","_type":"application/rss+xml","__prefix":"atom"}],"description":"Alerts warn about vulnerabilities, incidents, and other security issues that pose a significant risk.","language":"en","item":[{"title":"TA16-288A: Heightened DDoS Threat Posed by Mirai and Other Botnets","link":"https://www.us-cert.gov/ncas/alerts/TA16-288A","description":"\n\n\t\tOriginal release date: October 14, 2016 | Last revised: October 17, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<p>Internet of Things (IoT)—an emerging network of devices (e.g., printers, routers, video cameras, smart TVs) that connect to one another via the Internet, often automatically sending and receiving data</p>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>Recently, IoT devices have been used to create large-scale botnets—networks of devices infected with self-propagating malware—that can execute crippling distributed denial-of-service (DDoS) attacks. IoT devices are particularly susceptible to malware, so protecting these devices and connected hardware is critical to protect systems and networks.</p>\t\t\n\t\t<h3>Description</h3>\n\t\t<p>On September 20, 2016, Brian Krebs’ security blog (krebsonsecurity.com) was targeted by a massive DDoS attack, one of the largest on record, exceeding 620 gigabits per second (Gbps).[<a href=\"https://krebsonsecurity.com/2016/09/krebsonsecurity-hit-with-record-ddos/\">1</a>] An IoT botnet powered by Mirai malware created the DDoS attack. The Mirai malware continuously scans the Internet for vulnerable IoT devices, which are then infected and used in botnet attacks. The Mirai bot uses a short list of 62 common default usernames and passwords to scan for vulnerable devices. Because many IoT devices are unsecured or weakly secured, this short dictionary allows the bot to access hundreds of thousands of devices.[<a href=\"https://nakedsecurity.sophos.com/2016/10/05/mirai-internet-of-things-malware-from-krebs-ddos-attack-goes-open-source/\">2</a>] The purported Mirai author claimed that over 380,000 IoT devices were enslaved by the Mirai malware in the attack on Krebs’ website.[<a href=\"https://www.pcworld.com/article/3126362/security/iot-malware-behind-record-ddos-attack-is-now-available-to-all-hackers.html\">3</a>]</p><p>In late September, a separate Mirai attack on French webhost OVH broke the record for largest recorded DDoS attack. That DDoS was at least 1.1 terabits per second (Tbps), and may have been as large as 1.5 Tbps.[<a href=\"http://arstechnica.com/security/2016/09/botnet-of-145k-cameras-reportedly-deliver-internets-biggest-ddos-ever/\">4</a>]</p><p>The IoT devices affected in the latest Mirai incidents were primarily home routers, network-enabled cameras, and digital video recorders.[<a href=\"http://www.darkreading.com/denial-of-service-attacks/iot-ddos-attack-code-released-/d/d-id/1327086\">5</a>] Mirai malware source code was published online at the end of September, opening the door to more widespread use of the code to create other DDoS attacks.</p><p>In early October, Krebs on Security reported on a separate malware family responsible for other IoT botnet attacks.[<a href=\"https://krebsonsecurity.com/2016/10/source-code-for-iot-botnet-mirai-released/\">6</a>] This other malware, whose source code is not yet public, is named Bashlite. This malware also infects systems through default usernames and passwords. Level 3 Communications, a security firm, indicated that the Bashlite botnet may have about one million enslaved IoT devices.[<a href=\"http://blog.level3.com/security/attack-of-things/\">7</a>]</p>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>With the release of the Mirai source code on the Internet, there are increased risks of more botnets being generated. Both Mirai and Bashlite can exploit the numerous IoT devices that still use default passwords and are easily compromised. Such botnet attacks could severely disrupt an organization’s communications or cause significant financial harm.</p><p>Software that is not designed to be secure contains vulnerabilities that can be exploited. Software-connected devices collect data and credentials that could then be sent to an adversary’s collection point in a back-end application.</p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<p>Cybersecurity professionals should harden networks against the possibility of a DDoS attack. For more information on DDoS attacks, please refer to US-CERT Security Publication <a href=\"https://www.us-cert.gov/sites/default/files/publications/DDoS%20Quick%20Guide.pdf\">DDoS Quick Guide</a> and the US-CERT Alert on <a href=\"https://www.us-cert.gov/ncas/alerts/TA14-017A\">UDP-Based Amplification Attacks</a>.</p><p><strong><em>Mitigation</em></strong></p><p>In order to remove the Mirai malware from an infected IoT device, users and administrators should take the following actions:</p><ul><li>Disconnect device from the network.</li><li>While disconnected from the network and Internet, perform a reboot. Because Mirai malware exists in dynamic memory, rebooting the device clears the malware [<a href=\"https://ics-cert.us-cert.gov/alerts/ICS-ALERT-16-286-01\">8</a>].</li><li>Ensure that the password for accessing the device has been changed from the default password to a strong password. See US-CERT Tip <a href=\"https://www.us-cert.gov/ncas/tips/ST04-002\">Choosing and Protecting Passwords</a> for more information.</li><li>You should reconnect to the network only after rebooting and changing the password. If you reconnect before changing the password, the device could be quickly reinfected with the Mirai malware.</li></ul><p><strong><em>Preventive Steps</em></strong></p><p>In order to prevent a malware infection on an IoT device, users and administrators should take following precautions:</p><ul><li>Ensure all default passwords are changed to strong passwords. Default usernames and passwords for most devices can easily be found on the Internet, making devices with default passwords extremely vulnerable.</li><li>Update IoT devices with security patches as soon as patches become available.</li><li>Disable Universal Plug and Play (UPnP) on routers unless absolutely necessary.[<a href=\"https://www.ic3.gov/media/2015/150910.aspx\"><span style=\"text-decoration: underline;\">9</span></a>]</li><li>Purchase IoT devices from companies with a reputation for providing secure devices.</li><li>Consumers should be aware of the capabilities of the devices and appliances installed in their homes and businesses. If a device comes with a default password or an open Wi-Fi connection, consumers should change the password and only allow it to operate on a home network with a secured Wi-Fi router.</li><li>Understand the capabilities of any medical devices intended for at-home use. If the device transmits data or can be operated remotely, it has the potential to be infected.</li><li>Monitor Internet Protocol (IP) port 2323/TCP and port 23/TCP for attempts to gain unauthorized control over IoT devices using the network terminal (Telnet) protocol.[<a href=\"https://isc.sans.edu/forums/diary/What+is+happening+on+2323TCP/21563/\">10</a>]</li><li>Look for suspicious traffic on port 48101. Infected devices often attempt to spread malware by using port 48101 to send results to the threat actor.</li></ul>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"https://krebsonsecurity.com/2016/09/krebsonsecurity-hit-with-record-ddos/\">[1] KrebsOnSecurity: KrebsOnSecurity Hit With Record DDoS</a></li>\n\t\t\t\t\t<li><a href=\"https://nakedsecurity.sophos.com/2016/10/05/mirai-internet-of-things-malware-from-krebs-ddos-attack-goes-open-source/\">[2] Sophos: Mirai “internet of things” malware from Krebs DDoS attack goes open source</a></li>\n\t\t\t\t\t<li><a href=\"https://www.pcworld.com/article/3126362/security/iot-malware-behind-record-ddos-attack-is-now-available-to-all-hackers.html\">[3] PCWorld: Smart device malware behind record DDoS attack is now available to all hackers</a></li>\n\t\t\t\t\t<li><a href=\"http://arstechnica.com/security/2016/09/botnet-of-145k-cameras-reportedly-deliver-internets-biggest-ddos-ever/\">[4] ArsTechnica: Record-breaking DDoS reportedly delivered by &gt;145k hacked cameras</a></li>\n\t\t\t\t\t<li><a href=\"http://www.darkreading.com/denial-of-service-attacks/iot-ddos-attack-code-released-/d/d-id/1327086\">[5] InformationWeek DarkReading: IoT DDoS Attack Code Released</a></li>\n\t\t\t\t\t<li><a href=\"https://krebsonsecurity.com/2016/10/source-code-for-iot-botnet-mirai-released/\">[6] KrebsOnSecurity: Source Code for IoT Botnet \"Mirai\" Released</a></li>\n\t\t\t\t\t<li><a href=\"http://blog.level3.com/security/attack-of-things/\">[7] Level 3 Threat Research Labs: Attack of Things!</a></li>\n\t\t\t\t\t<li><a href=\"https://ics-cert.us-cert.gov/alerts/ICS-ALERT-16-286-01\">[8] ICS-CERT: Sierra Wireless Mitigations Against Mirai Malware</a></li>\n\t\t\t\t\t<li><a href=\"https://www.ic3.gov/media/2015/150910.aspx\">[9] Federal Bureau of Investigation Public Service Announcement: Internet of Things Poses Opportunities for Cyber Crime</a></li>\n\t\t\t\t\t<li><a href=\"https://isc.sans.edu/forums/diary/What+is+happening+on+2323TCP/21563/\">[10] SANS ISC InfoSec Forums: What is happening on 2323/TCP?</a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>October 14, 2016: Initial release</li>\n\t\t\t\t\t\t<li>October 17, 2016: Added ICS-CERT reference [8]</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Fri, 14 Oct 2016 23:59:41 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"7921 at https://www.us-cert.gov"}},{"title":"TA16-250A: The Increasing Threat to Network Infrastructure Devices and Recommended Mitigations","link":"https://www.us-cert.gov/ncas/alerts/TA16-250A","description":"\n\n\t\tOriginal release date: September 06, 2016 | Last revised: September 28, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<p>Network Infrastructure Devices<br /> </p>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>The advancing capabilities of organized hacker groups and cyber adversaries create an increasing global threat to information systems. The rising threat levels place more demands on security personnel and network administrators to protect information systems. Protecting the network infrastructure is critical to preserve the confidentiality, integrity, and availability of communication and services across an enterprise.</p><p>To address threats to network infrastructure devices, this Alert provides information on recent vectors of attack that advanced persistent threat (APT) actors are targeting, along with prevention and mitigation recommendations.<br /> </p>\t\t\n\t\t<h3>Description</h3>\n\t\t<p>Network infrastructure consists of interconnected devices designed to transport communications needed for data, applications, services, and multi-media. Routers and firewalls are the focus of this alert; however, many other devices exist in the network, such as switches, load-balancers, intrusion detection systems, etc. Perimeter devices, such as firewalls and intrusion detection systems, have been the traditional technologies used to secure the network, but as threats change, so must security strategies. Organizations can no longer rely on perimeter devices to protect the network from cyber intrusions; organizations must also be able to contain the impact/losses within the internal network and infrastructure.</p><p>For several years now, vulnerable network devices have been the attack-vector of choice and one of the most effective techniques for sophisticated hackers and advanced threat actors. In this environment, there has never been a greater need to improve network infrastructure security. Unlike hosts that receive significant administrative security attention and for which security tools such as anti-malware exist, network devices are often working in the background with little oversight—until network connectivity is broken or diminished. Malicious cyber actors take advantage of this fact and often target network devices. Once on the device, they can remain there undetected for long periods. After an incident, where administrators and security professionals perform forensic analysis and recover control, a malicious cyber actor with persistent access on network devices can reattack the recently cleaned hosts. For this reason, administrators need to ensure proper configuration and control of network devices.</p><h4>Proliferation of Threats to Information Systems</h4><h4><em>SYNful Knock</em></h4><p>In September 2015, an attack known as SYNful Knock was disclosed. SYNful Knock silently changes a router’s operating system image, thus allowing attackers to gain a foothold on a victim’s network. The malware can be customized and updated once embedded. When the modified malicious image is uploaded, it provides a backdoor into the victim’s network. Using a crafted TCP SYN packet, a communication channel is established between the compromised device and the malicious command and control (C2) server. The impact of this infection to a network or device is severe and most likely indicates that there may be additional backdoors or compromised devices on the network. This foothold gives an attacker the ability to maneuver and infect other hosts and access sensitive data.</p><p>The initial infection vector does not leverage a zero-day vulnerability. Attackers either use the default credentials to log into the device or obtain weak credentials from other insecure devices or communications. The implant resides within a modified IOS image and, when loaded, maintains its persistence in the environment, even after a system reboot. Any further modules loaded by the attacker will only exist in the router’s volatile memory and will not be available for use after the device reboots. However, these devices are rarely or never rebooted.</p><p>To prevent the size of the image from changing, the malware overwrites several legitimate IOS functions with its own executable code. The attacker examines the functionality of the router and determines functions that can be overwritten without causing issues on the router. Thus, the overwritten functions will vary upon deployment.</p><p>The attacker can utilize the secret backdoor password in three different authentication scenarios. In these scenarios the implant first checks to see if the user input is the backdoor password. If so, access is granted. Otherwise, the implanted code will forward the credentials for normal verification of potentially valid credentials. This generally raises the least amount of suspicion. Cisco has provided an alert on this attack vector. For more information, see the <a href=\"https://www.cisco.com/c/en/us/about/security-center/event-response/synful-knock.html\">Cisco SYNful Knock Security Advisory</a>.</p><p>Other attacks against network infrastructure devices have also been reported, including more complicated persistent malware that silently changes the firmware on the device that is used to load the operating system so that the malware can inject code into the running operating system. For more information, please see <a href=\"https://blogs.cisco.com/security/evolution-of-attacks-on-cisco-ios-devices\">Cisco's description of the evolution of attacks on Cisco IOS devices</a>.</p><h4><em>Cisco Adaptive Security Appliance (ASA)</em></h4><p>A Cisco ASA device is a network device that provides firewall and Virtual Private Network (VPN) functionality. These devices are often deployed at the edge of a network to protect a site’s network infrastructure, and to give remote users access to protected local resources.</p><p>In June 2016, NCCIC received several reports of compromised Cisco ASA devices that were modified in an unauthorized way. The ASA devices directed users to a location where malicious actors tried to socially engineer the users into divulging their credentials.</p><p>It is suspected that malicious actors leveraged <a href=\"https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-3393\">CVE-2014-3393 </a>to inject malicious code into the affected devices. The malicious actor would then be able to modify the contents of the Random Access Memory Filing System (RAMFS) cache file system and inject the malicious code into the appliance’s configuration. Refer to the <a href=\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20141008-asa\">Cisco Security Advisory Multiple Vulnerabilities in Cisco ASA Software </a>for more information and for remediation details.</p><p>In August 2016, a group known as “Shadow Brokers” publicly released a large number of files, including exploitation tools for both old and newly exposed vulnerabilities. Cisco ASA devices were found to be vulnerable to the released exploit code. In response, Cisco released an update to address a newly disclosed Cisco ASA Simple Network Management Protocol (SNMP) remote code execution vulnerability (<a href=\"https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6366\">CVE-2016-6366</a>). In addition, one exploit tool targeted a previously patched Cisco vulnerability (<a href=\"https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6367\">CVE-2016-6367</a>). Although Cisco provided <a href=\"https://blogs.cisco.com/security/shadow-brokers\">patches</a> to fix this Cisco ASA command-line interface (CLI) remote code execution vulnerability in 2011, devices that remain unpatched are still vulnerable to the described attack. Attackers may target vulnerabilities for months or even years after patches become available.</p>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>If the network infrastructure is compromised, malicious hackers or adversaries can gain full control of the network infrastructure enabling further compromise of other types of devices and data and allowing traffic to be redirected, changed, or denied. Possibilities of manipulation include denial-of-service, data theft, or unauthorized changes to the data.</p><p>Intruders with infrastructure privilege and access can impede productivity and severely hinder re-establishing network connectivity. Even if other compromised devices are detected, tracking back to a compromised infrastructure device is often difficult.</p><p>Malicious actors with persistent access to network devices can reattack and move laterally after they have been ejected from previously exploited hosts.<br /> </p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<h4>1.    Segregate Networks and Functions</h4><p>Proper network segmentation is a very effective security mechanism to prevent an intruder from propagating exploits or laterally moving around an internal network. On a poorly segmented network, intruders are able to extend their impact to control critical devices or gain access to sensitive data and intellectual property. Security architects must consider the overall infrastructure layout, segmentation, and segregation. Segregation separates network segments based on role and functionality. A securely segregated network can contain malicious occurrences, reducing the impact from intruders, in the event that they have gained a foothold somewhere inside the network.</p><h5><em>Physical Separation of Sensitive Information</em></h5><p>Local Area Network (LAN) segments are separated by traditional network devices such as routers. Routers are placed between networks to create boundaries, increase the number of broadcast domains, and effectively filter users’ broadcast traffic. These boundaries can be used to contain security breaches by restricting traffic to separate segments and can even shut down segments of the network during an intrusion, restricting adversary access.</p><h5>Recommendations:</h5><ul><li>Implement Principles of Least Privilege and need-to-know when designing network segments.</li><li>Separate sensitive information and security requirements into network segments.</li><li>Apply security recommendations and secure configurations to all network segments and network layers.</li></ul><h5><em>Virtual Separation of Sensitive Information        </em></h5><p>As technologies change, new strategies are developed to improve IT efficiencies and network security controls. Virtual separation is the logical isolation of networks on the same physical network. The same physical segmentation design principles apply to virtual segmentation but no additional hardware is required. Existing technologies can be used to prevent an intruder from breaching other internal network segments.</p><h5>Recommendations:</h5><ul><li>Use Private Virtual LANs to isolate a user from the rest of the broadcast domains.</li><li>Use Virtual Routing and Forwarding (VRF) technology to segment network traffic over multiple routing tables simultaneously on a single router.</li><li>Use VPNs to securely extend a host/network by tunneling through public or private networks.</li></ul><h4><br />2.    Limit Unnecessary Lateral Communications</h4><p>Allowing unfiltered workstation-to-workstation communications (as well as other peer-to-peer communications) creates serious vulnerabilities, and can allow a network intruder to easily spread to multiple systems. An intruder can establish an effective “beach head” within the network, and then spread to create backdoors into the network to maintain persistence and make it difficult for defenders to contain and eradicate.</p><h5>Recommendations:</h5><ul><li>Restrict communications using host-based firewall rules to deny the flow of packets from other hosts in the network. The firewall rules can be created to filter on a host device, user, program, or IP address to limit access from services and systems.</li><li>Implement a VLAN Access Control List (VACL), a filter that controls access to/from VLANs. VACL filters should be created to deny packets the ability to flow to other VLANs.</li><li>Logically segregate the network using physical or virtual separation allowing network administrators to isolate critical devices onto network segments.<br /> </li></ul><h4>3.    Harden Network Devices</h4><p>A fundamental way to enhance network infrastructure security is to safeguard networking devices with secure configurations. Government agencies, organizations, and vendors supply a wide range of resources to administrators on how to harden network devices. These resources include benchmarks and best practices. These recommendations should be implemented in conjunction with laws, regulations, site security policies, standards, and industry best practices. These guides provide a baseline security configuration for the enterprise that protects the integrity of network infrastructure devices. This guidance supplements the network security best practices supplied by vendors.</p><h5>Recommendations:</h5><ul><li>Disable unencrypted remote admin protocols used to manage network infrastructure (e.g., Telnet, FTP).</li><li>Disable unnecessary services (e.g. discovery protocols, source routing, HTTP, SNMP, BOOTP).</li><li>Use SNMPv3 (or subsequent version) but do not use SNMP community strings.</li><li>Secure access to the console, auxiliary, and VTY lines.</li><li>Implement robust password policies and use the strongest password encryption available.</li><li>Protect router/switch by controlling access lists for remote administration.</li><li>Restrict physical access to routers/switches.</li><li>Backup configurations and store offline. Use the latest version of the network device operating system and update with all patches.</li><li>Periodically test security configurations against security requirements.</li><li>Protect configuration files with encryption and/or access controls when sending them electronically and when they are stored and backed up.<br /> </li></ul><h4>4.    Secure Access to Infrastructure Devices</h4><p>Administrative privileges on infrastructure devices allow access to resources that are normally unavailable to most users and permit the execution of actions that would otherwise be restricted. When administrator privileges are improperly authorized, granted widely, and/or not closely audited, intruders can exploit them. These compromised privileges can enable adversaries to traverse a network, expanding access and potentially allowing full control of the infrastructure backbone. Unauthorized infrastructure access can be mitigated by properly implementing secure access policies and procedures.</p><h5>Recommendations:</h5><ul><li>Implement Multi-Factor Authentication – Authentication is a process to validate a user’s identity. Weak authentication processes are commonly exploited by attackers. Multi-factor authentication uses at least two identity components to authenticate a user’s identity. Identity components include something the user knows (e.g., password); an object the user has possession of (e.g., token); and a trait unique to the specific person (e.g., biometric).</li><li>Manage Privileged Access – Use an authorization server to store access information for network device management. This type of server will enable network administrators to assign different privilege levels to users based on the principle of least privilege. When a user tries to execute an unauthorized command, it will be rejected. To increase the strength and robustness of user authentication, implement a hard token authentication server in addition to the AAA server, if possible. Multi-factor authentication increases the difficulty for intruders to steal and reuse credentials to gain access to network devices.</li><li>Manage Administrative Credentials – Although multi-factor authentication is highly recommended and a best practice, systems that cannot meet this requirement can at least improve their security level by changing default passwords and enforcing complex password policies. Network accounts must contain complex passwords of at least 14 characters from multiple character domains including lowercase, uppercase, numbers, and special characters. Enforce password expiration and reuse policies. If passwords are stored for emergency access, keep these in a protected off-network location, such as a safe.<br /> </li></ul><h4>5.    Perform Out-of-Band Management</h4><p>Out-of-Band (OoB) management uses alternate communication paths to remotely manage network infrastructure devices. These dedicated paths can vary in configuration to include anything from virtual tunneling to physical separation. Using OoB access to manage the network infrastructure will strengthen security by limiting access and separating user traffic from network management traffic. OoB management provides security monitoring and can implement corrective actions without allowing the adversary who may have already compromised a portion of the network to observe these changes.</p><p>OoB management can be implemented physically or virtually, or through a hybrid of the two. Building additional physical network infrastructure is the most secure option for the network managers, although it can be very expensive to implement and maintain. Virtual implementation is less costly, but still requires significant configuration changes and administration. In some situations, such as access to remote locations, virtual encrypted tunnels may be the only viable option.</p><h5>Recommendations:</h5><ul><li>Segregate standard network traffic from management traffic.</li><li>Enforce that management traffic on devices only comes from the OoB.</li><li>Apply encryption to all management channels.</li><li>Encrypt all remote access to infrastructure devices such as terminal or dial-in servers.</li><li>Manage all administrative functions from a dedicated host (fully patched) over a secure channel, preferably on the OoB.</li><li>Harden network management devices by testing patches, turning off unnecessary services on routers and switches, and enforcing strong password policies. Monitor the network and review logs Implement access controls that only permit required administrative or management services (SNMP, NTP SSH, FTP, TFTP).<br /> </li></ul><h4>6.    Validate Integrity of Hardware and Software</h4><p>Products purchased through unauthorized channels are often known as “counterfeit,” “secondary,” or “grey market” devices. There have been numerous reports in the press regarding grey market hardware and software being introduced into the marketplace. Grey market products have not been thoroughly tested to meet quality standards and can introduce risks to the network. Lack of awareness or validation of the legitimacy of hardware and software presents a serious risk to users’ information and the overall integrity of the network environment. Products purchased from the secondary market run the risk of having the supply chain breached, which can result in the introduction of counterfeit, stolen, or second-hand devices. This could affect network performance and compromise the confidentiality, integrity, or availability of network assets. Furthermore, breaches in the supply chain provide an opportunity for malicious software or hardware to be installed on the equipment. In addition, unauthorized or malicious software can be loaded onto a device after it is in operational use, so integrity checking of software should be done on a regular basis.</p><h5>Recommendations:</h5><ul><li>Maintain strict control of the supply chain; purchase only from authorized resellers.</li><li>Require resellers to implement a supply chain integrity check to validate hardware and software authenticity.</li><li>Inspect the device for signs of tampering.</li><li>Validate serial numbers from multiple sources.</li><li>Download software, updates, patches, and upgrades from validated sources.</li><li>Perform hash verification and compare values against the vendor’s database to detect unauthorized modification to the firmware.</li><li>Monitor and log devices, verifying network configurations of devices on a regular schedule.</li><li>Train network owners, administrators, and procurement personnel to increase awareness of grey market devices.</li></ul><p> </p><table align=\"center\" border=\"1\" cellpadding=\"0\" cellspacing=\"0\" class=\"general-table\" style=\"width: 100%;\"><caption><strong>Shadow Broker Exploits</strong></caption><thead><tr><th scope=\"col\"><strong>Vendor</strong></th><th scope=\"col\"><strong>CVE</strong></th><th scope=\"col\"><strong>Exploit Name</strong></th><th scope=\"col\"><strong>Vulnerability</strong></th></tr></thead><tbody><tr><td>Fortinet</td><td><a href=\"https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6909\">CVE-2016-6909</a>   </td><td>EGREGIOUSBLUNDER</td><td>Authentication cookie overflow</td></tr><tr><td>WatchGuard   </td><td><a href=\"https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-7089\">CVE-2016-7089</a></td><td>ESCALATEPLOWMAN</td><td>Command line injection via ipconfig</td></tr><tr><td>Cisco</td><td><a href=\"https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6366\">CVE-2016-6366</a></td><td>EXTRABACON</td><td>SNMP remote code execution</td></tr><tr><td>Cisco</td><td><a href=\"https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6367\">CVE-2016-6367</a></td><td>EPICBANANA</td><td>Command line injection remote code execution</td></tr><tr><td>Cisco</td><td><a href=\"https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-6415\">CVE-2016-6415</a></td><td>BENIGNCERTAIN/PIXPOCKET   </td><td>Information/memory leak</td></tr><tr><td>TOPSEC</td><td>N/A</td><td>ELIGIBLEBACHELOR</td><td>Attack vector unknown, but has an XML-like payload<br />beginning with &lt;?tos length=\"001e.%8.8x\"?</td></tr><tr><td>TOPSEC</td><td>N/A</td><td>ELIGIBLEBOMBSHELL</td><td>HTTP cookie command injection</td></tr><tr><td>TOPSEC</td><td>N/A</td><td>ELIGIBLECANDIDATE</td><td>HTTP cookie command injection</td></tr><tr><td>TOPSEC</td><td>N/A</td><td>ELIGIBLECONTESTANT</td><td>HTTP POST parameter injection</td></tr></tbody></table><p><br /> </p>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"http://www.cisco.com/c/en/us/about/security-center/event-response/synful-knock.html\">Cisco SYNful Knock Security Advisory</a></li>\n\t\t\t\t\t<li><a href=\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20141008-asa\">Cisco Security Advisory Multiple Vulnerabilities in Cisco ASA Software</a></li>\n\t\t\t\t\t<li><a href=\"https://blogs.cisco.com/security/evolution-of-attacks-on-cisco-ios-devices\">Cisco Evolution of Attacks on Cisco IOS Devices </a></li>\n\t\t\t\t\t<li><a href=\"https://cisco.com/c/en/us/about/security-center/integrity-assurance.html\">Cisco IOS Software Integrity Assurance </a></li>\n\t\t\t\t\t<li><a href=\"https://www.iad.gov/iad/library/ia-advisories-alerts/recommendations-to-mitigate-unauthorized-cisco-rommon-access-and-validate-boot-roms.cfm\">Information Assurance Advisory NO. IAA U/OO/802097-16 Mitigate Unauthorized Cisco ROMMON</a></li>\n\t\t\t\t\t<li><a href=\"https://www.iad.gov/iad/library/ia-advisories-alerts/vulnerability-in-cisco-adaptive-security-appliances-identified-in-open-source-v1.cfm\">Information Assurance Advisory NO. IAA U/OO/802488-16 Vulnerabilities in Cisco Adaptive Security Appliances</a></li>\n\t\t\t\t\t<li><a href=\"https://www.iad.gov/iad/library/ia-guidance/security-tips/network-mitigations-package-infrastructure.cfm\">Information Assurance Directorate Network Mitigations Package – Infrastructure </a></li>\n\t\t\t\t\t<li><a href=\"https://www.cisco.com/en/US/prod/collateral/switches/ps9441/ps9402/guide_c07-665160.html\">Cisco Guide to Securing Cisco NX-OS Software Devices</a></li>\n\t\t\t\t\t<li><a href=\"https://cisco.com/web/about/security/intelligence/CiscoIOSXR.html\">Cisco Guide to Harden Cisco IOS XR Devices</a></li>\n\t\t\t\t\t<li><a href=\"https://www.cisco.com/en/US/tech/tk648/tk361/technologies_tech_note09186a0080120f48.shtml\">Cisco Guide to Harden Cisco IOS Devices </a></li>\n\t\t\t\t\t<li><a href=\"https://www.cisco.com/c/en/us/about/security-center/framework-segmentation.html\">Cisco: A Framework to Protect Data Through Segmentation </a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>September 6, 2016: Initial release</li>\n\t\t\t\t\t\t<li>September 13, 2016: Added additional references</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Tue, 06 Sep 2016 22:29:52 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"7737 at https://www.us-cert.gov"}},{"title":"TA16-187A: Symantec and Norton Security Products Contain Critical Vulnerabilities","link":"https://www.us-cert.gov/ncas/alerts/TA16-187A","description":"\n\n\t\tOriginal release date: July 05, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<p>All Symantec and Norton branded antivirus products</p>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>Symantec and Norton branded antivirus products contain multiple vulnerabilities. Some of these products are in widespread use throughout government and industry. Exploitation of these vulnerabilities could allow a remote attacker to take control of an affected system.</p>\t\t\n\t\t<h3>Description</h3>\n\t\t<p>The vulnerabilities are listed below:</p><p>CVE-2016-2207</p><ul><li><p>Symantec Antivirus multiple remote memory corruption unpacking RAR [<a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=810\">1</a>]</p></li></ul><p>CVE-2016-2208</p><ul><li>Symantec antivirus products use common unpackers to extract malware binaries when scanning a system. A heap overflow vulnerability in the ASPack unpacker could allow an unauthenticated remote attacker to gain root privileges on Linux or OSX platforms. The vulnerability can be triggered remotely using a malicious file (via email or link) with no user interaction. [<a href=\"http://googleprojectzero.blogspot.com/2016/06/how-to-compromise-enterprise-endpoint.html\">2</a>]</li></ul><p>CVE-2016-2209 </p><ul><li>Symantec: PowerPoint misaligned stream-cache remote stack buffer overflow [<a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=823\">3</a>]</li></ul><p>CVE-2016-2210</p><ul><li>Symantec: Remote Stack Buffer Overflow in dec2lha library [<a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=814\">4</a>]         </li></ul><p>CVE-2016-2211</p><ul><li>Symantec: Symantec Antivirus multiple remote memory corruption unpacking MSPACK Archives [<a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=816\">5</a>]</li></ul><p>CVE-2016-3644</p><ul><li>Symantec: Heap overflow modifying MIME messages [<a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=818\">6</a>]      </li></ul><p>CVE-2016-3645</p><ul><li>Symantec: Integer Overflow in TNEF decoder [<a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=819\">7</a>]       </li></ul><p>CVE-2016 -3646</p><ul><li>Symantec: missing bounds checks in dec2zip ALPkOldFormatDecompressor::UnShrink [<a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=821\">8</a>]</li></ul><p> </p>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>The large number of products affected (24 products), across multiple platforms (OSX, Windows, and Linux), and the severity of these vulnerabilities (remote code execution at root or SYSTEM privilege) make this a very serious event. A remote, unauthenticated attacker may be able to run arbitrary code at root or SYSTEM privileges by taking advantage of these vulnerabilities. Some of the vulnerabilities require no user interaction and are network-aware, which could result in a wormable-event.</p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<p>Symantec has provided patches or hotfixes to these vulnerabilities in their SYM16-008 [<a href=\"https://www.symantec.com/security_response/securityupdates/detail.jsp?fid=security_advisory&amp;pvid=security_advisory&amp;year=2016&amp;suid=20160516_00\">9</a>] and SYM16-010 [<a href=\"https://www.symantec.com/security_response/securityupdates/detail.jsp?fid=security_advisory&amp;pvid=security_advisory&amp;year=&amp;suid=20160628_00\">10</a>] security advisories.</p><p>US-CERT encourages users and network administrators to patch Symantec or Norton antivirus products immediately. While there has been no evidence of exploitation, the ease of attack, widespread nature of the products, and severity of the exploit may make this vulnerability a popular target.</p>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=810\">[1] Symantec Antivirus multiple remote memory corruption unpacking RAR</a></li>\n\t\t\t\t\t<li><a href=\"http://googleprojectzero.blogspot.com/2016/06/how-to-compromise-enterprise-endpoint.html\">[2] How to Compromise the Enterprise Endpoint</a></li>\n\t\t\t\t\t<li><a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=823\">[3] Symantec: PowerPoint misaligned stream-cache remote stack buffer overflow</a></li>\n\t\t\t\t\t<li><a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=814\">[4] Symantec: Remote Stack Buffer Overflow in dec2lha library</a></li>\n\t\t\t\t\t<li><a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=816\">[5] Symantec: Symantec Antivirus multiple remote memory corruption unpacking MSPACK Archives</a></li>\n\t\t\t\t\t<li><a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=818\">[6] Symantec: Heap overflow modifying MIME messages</a></li>\n\t\t\t\t\t<li><a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=819\">[7] Symantec: Integer Overflow in TNEF decoder</a></li>\n\t\t\t\t\t<li><a href=\"https://bugs.chromium.org/p/project-zero/issues/detail?id=821\">[8] Symantec: missing bounds checks in dec2zip ALPkOldFormatDecompressor::UnShrink</a></li>\n\t\t\t\t\t<li><a href=\"https://www.symantec.com/security_response/securityupdates/detail.jsp?fid=security_advisory&pvid=security_advisory&year=2016&suid=20160516_00\">[9] Symantec SYM16-008 security advisory</a></li>\n\t\t\t\t\t<li><a href=\"https://www.symantec.com/security_response/securityupdates/detail.jsp?fid=security_advisory&pvid=security_advisory&year=&suid=20160628_00\">[10] Symantec SYM16-010 security advisory</a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>July 5, 2016: Initial Release</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Tue, 05 Jul 2016 14:50:24 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"6613 at https://www.us-cert.gov"}},{"title":"TA16-144A: WPAD Name Collision Vulnerability","link":"https://www.us-cert.gov/ncas/alerts/TA16-144A","description":"\n\n\t\tOriginal release date: May 23, 2016 | Last revised: October 06, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<ul><li>Windows, OS X, Linux systems, and web browsers with WPAD enabled</li><li>Networks using unregistered or unreserved TLDs</li></ul>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>Web Proxy Auto-Discovery (WPAD) Domain Name System (DNS) queries that are intended for resolution on private or enterprise DNS servers have been observed reaching public DNS servers [<a href=\"https://www.Verisign.com/CERTAlert\">1</a>]. In combination with the new generic top level domain (gTLD) program’s incorporation of previously undelegated gTLDs for public registration, leaked WPAD queries could result in domain name collisions with internal network naming schemes [<a href=\"https://www.icann.org/resources/pages/name-collision-2013-12-06-en\">2</a>] [<a href=\"https://newgtlds.icann.org/en/about/program\">3</a>]. Opportunistic domain registrants could abuse these collisions by configuring external proxies for network traffic and enabling man-in-the-middle (MitM) attacks across the Internet.</p>\t\t\n\t\t<h3>Description</h3>\n\t\t<p>WPAD is a protocol used to ensure all systems in an organization use the same web proxy configuration. Instead of individually modifying configurations on each device connected to a network, WPAD locates a proxy configuration file and applies the configuration automatically.<br /><br />The use of WPAD is enabled by default on all Microsoft Windows operating systems and Internet Explorer browsers. WPAD is supported but not enabled by default on Mac OS X and Linux-based operating systems, as well as Safari, Chrome, and Firefox browsers.</p><p>With the New gTLD program, previously undelegated gTLD strings are now being delegated for public domain name registration [<a href=\"https://newgtlds.icann.org/en/about/program\">3</a>]. These strings may be used by private or enterprise networks, and in certain circumstances, such as when a work computer is connected from a home or external network, WPAD DNS queries may be made in error to public DNS servers. Attackers may exploit such leaked WPAD queries by registering the leaked domain and setting up MitM proxy configuration files on the Internet.</p><p>Other services (e.g., mail and internal web sites) may also perform DNS queries and attempt to automatically connect to supposedly internal DNS names [<a href=\"https://www.us-cert.gov/ncas/alerts/TA15-240A\">4</a>].</p>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>Leaked WPAD queries could result in domain name collisions with internal network naming schemes. If an attacker registers a domain to answer leaked WPAD queries and configures a valid proxy, there is potential to conduct man-in-the-middle (MitM) attacks across the Internet.</p><p>The WPAD vulnerability is significant to corporate assets such as laptops. In some cases, these assets are vulnerable even while at work, but observations indicate that most assets become vulnerable when used outside an internal network (e.g., home networks, public Wi-Fi networks).</p><p>The impact of other types of leaked DNS queries and connection attempts varies depending on the type of service and its configuration.</p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<p>US-CERT encourages users and network administrators to implement the following recommendations to provide a more secure and efficient network infrastructure:</p><ul><li>Consider disabling automatic proxy discovery/configuration in browsers and operating systems unless those systems will only be used on internal networks.</li><li>Consider using a registered and fully qualified domain name (FQDN) from global DNS as the root for enterprise and other internal namespace.</li><li>Consider using an internal TLD that is under your control and restricted from registration with the new gTLD program. Note that there is no assurance that the current list of “Reserved Names” from the new gTLD Applicant Guidebook (AGB) will remain reserved with subsequent rounds of new gTLDs [<a href=\"https://newgtlds.icann.org/en/applicants/agb/guidebook-full-04jun12-en.pdf\">5</a>].</li><li>Configure internal DNS servers to respond authoritatively to internal TLD queries.</li><li>Configure firewalls and proxies to log and block outbound requests for wpad.dat files.</li><li>Identify expected WPAD network traffic and monitor the public namespace or consider registering domains defensively to avoid future name collisions.</li><li>File a report with ICANN if your system is suffering demonstrable severe harm due to name collision by visiting <a href=\"https://forms.icann.org/en/help/name-collision/report-problems\">https://forms.icann.org/en/help/name-collision/report-problems</a>.</li></ul>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"https://www.Verisign.com/CERTAlert\">[1] Verisign – MitM Attack by Name Collision: Cause Analysis and Vulnerability Assessment in the New gTLD Era</a></li>\n\t\t\t\t\t<li><a href=\"https://www.icann.org/resources/pages/name-collision-2013-12-06-en\">[2] ICANN – Name Collision Resources &amp; Information</a></li>\n\t\t\t\t\t<li><a href=\"https://newgtlds.icann.org/en/about/program\">[3] ICANN – New gTLDs </a></li>\n\t\t\t\t\t<li><a href=\"https://www.us-cert.gov/ncas/alerts/TA15-240A\">[4] US-CERT – Controlling Outbound DNS Access </a></li>\n\t\t\t\t\t<li><a href=\"https://newgtlds.icann.org/en/applicants/agb/guidebook-full-04jun12-en.pdf\">[5] ICANN – gTLD Applicant Guidebook</a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>May 23, 2016: Initial Release</li>\n\t\t\t\t\t\t<li>June 1, 2016: Added information on using TLDs restricted from registration with the gTLD program</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Mon, 23 May 2016 11:38:50 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"6514 at https://www.us-cert.gov"}},{"title":"TA16-132A: Exploitation of SAP Business Applications","link":"https://www.us-cert.gov/ncas/alerts/TA16-132A","description":"\n\n\t\tOriginal release date: May 11, 2016 | Last revised: September 29, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<p>Outdated or misconfigured SAP systems</p>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>At least 36 organizations worldwide are affected by an SAP vulnerability <a href=\"https://www.onapsis.com/tip-iceberg-wild-exploitation-cyber-attacks-sap-business-applications\">[1]</a>. Security researchers from Onapsis discovered indicators of exploitation against these organizations’ SAP business applications.</p><p>The observed indicators relate to the abuse of the Invoker Servlet, a built-in functionality in SAP NetWeaver Application Server Java systems (SAP Java platforms). The Invoker Servlet contains a vulnerability that was patched by SAP in 2010. However, the vulnerability continues to affect outdated and misconfigured SAP systems.</p>\t\t\n\t\t<h3>Description</h3>\n\t\t<p>SAP systems running outdated or misconfigured software are exposed to increased risks of malicious attacks.</p><p>The Invoker Servlet vulnerability affects business applications running on SAP Java platforms.</p><p>SAP Java platforms are the base technology stack for many SAP business applications and technical components, including:</p><ul><li>SAP Enterprise Resource Planning (ERP),</li><li>SAP Product Lifecycle Management (PLM),</li><li>SAP Customer Relationship Management (CRM),</li><li>SAP Supply Chain Management (SCM),</li><li>SAP Supplier Relationship Management (SRM),</li><li>SAP NetWeaver Business Warehouse (BW),</li><li>SAP Business Intelligence (BI),</li><li>SAP NetWeaver Mobile Infrastructure (MI),</li><li>SAP Enterprise Portal (EP),</li><li>SAP Process Integration (PI),</li><li>SAP Exchange Infrastructure (XI),</li><li>SAP Solution Manager (SolMan),</li><li>SAP NetWeaver Development Infrastructure (NWDI),</li><li>SAP Central Process Scheduling (CPS),</li><li>SAP NetWeaver Composition Environment (CE),</li><li>SAP NetWeaver Enterprise Search,</li><li>SAP NetWeaver Identity Management (IdM), and</li><li>SAP Governance, Risk &amp; Control 5.x (GRC).</li></ul><p>The vulnerability resides on the SAP application layer, so it is independent of the operating system and database application that support the SAP system.</p>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>Exploitation of the Invoker Servlet vulnerability gives unauthenticated remote attackers full access to affected SAP platforms, providing complete control of the business information and processes on these systems, as well as potential access to other systems.</p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<p>In order to mitigate this vulnerability, US-CERT recommends users and administrators implement SAP Security Note 1445998 and disable the Invoker Servlet. For more mitigation details, please review the Onapsis threat report <a href=\"https://www.onapsis.com/tip-iceberg-wild-exploitation-cyber-attacks-sap-business-applications\">[1]</a>.</p><p>In addition, US-CERT encourages that users and administrators:</p><ul><li>Scan systems for all known vulnerabilities, such as missing security patches and dangerous system configurations.</li><li>Identify and analyze the security settings of SAP interfaces between systems and applications to understand risks posed by these trust relationships.</li><li>Analyze systems for malicious or excessive user authorizations.</li><li>Monitor systems for indicators of compromise resulting from the exploitation of vulnerabilities.</li><li>Monitor systems for suspicious user behavior, including both privileged and non-privileged users.</li><li>Apply threat intelligence on new vulnerabilities to improve the security posture against advanced targeted attacks.</li><li>Define comprehensive security baselines for systems and continuously monitor for compliance violations and remediate detected deviations.</li></ul><p>These recommendations apply to SAP systems in public, private, and hybrid cloud environments.</p><p><em>Note: The U.S. Government does not endorse or support any particular product or vendor.</em></p>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"https://www.onapsis.com/tip-iceberg-wild-exploitation-cyber-attacks-sap-business-applications\">[1] Onapsis Threat Report: Wild Exploitation &amp; Cyber-Attacks on SAP Business Applications</a></li>\n\t\t\t\t\t<li><a href=\"https://help.sap.com/saphelp_nw70ehp2/helpdata/en/bb/f2b9d88ba4e8459e5a69cb513597ec/frameset.htm\">[2] SAP: Invoker Servlet </a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>May 11, 2016: Initial Release</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Wed, 11 May 2016 11:31:14 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"6502 at https://www.us-cert.gov"}},{"title":"TA16-105A: Apple Ends Support for QuickTime for Windows; New Vulnerabilities Announced","link":"https://www.us-cert.gov/ncas/alerts/TA16-105A","description":"\n\n\t\tOriginal release date: April 14, 2016 | Last revised: September 29, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<p>Microsoft Windows with Apple QuickTime installed</p>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>According to Trend Micro, Apple will no longer be providing security updates for QuickTime for Windows, leaving this software vulnerable to exploitation. <a href=\"https://blog.trendmicro.com/urgent-call-action-uninstall-quicktime-windows-today/\">[1]</a></p>\t\t\n\t\t<h3>Description</h3>\n\t\t<p>All software products have a lifecycle. Apple will no longer be providing security updates for QuickTime for Windows. <a href=\"https://blog.trendmicro.com/urgent-call-action-uninstall-quicktime-windows-today/\">[1]</a></p><p>The Zero Day Initiative has issued advisories for two vulnerabilities found in QuickTime for Windows. <a href=\"https://zerodayinitiative.com/advisories/ZDI-16-241/\">[2]</a> <a href=\"https://www.zerodayinitiative.com/advisories/ZDI-16-242/\">[3]</a></p>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>Computer systems running unsupported software are exposed to elevated cybersecurity dangers, such as increased risks of malicious attacks or electronic data loss. Exploitation of QuickTime for Windows vulnerabilities could allow remote attackers to take control of affected systems.</p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<p>Computers running QuickTime for Windows will continue to work after support ends. However, using unsupported software may increase the risks from viruses and other security threats. Potential negative consequences include loss of confidentiality, integrity, or availability of data, as well as damage to system resources or business assets. The only mitigation available is to uninstall QuickTime for Windows. Users can find instructions for uninstalling QuickTime for Windows on the Apple <a href=\"https://support.apple.com/en-us/HT205771\">Uninstall QuickTime</a> page. [4]</p>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"https://blog.trendmicro.com/urgent-call-action-uninstall-quicktime-windows-today/\">[1] Trend Micro - Urgent Call to Action: Uninstall QuickTime for Windows Today</a></li>\n\t\t\t\t\t<li><a href=\"https://zerodayinitiative.com/advisories/ZDI-16-241/\">[2] Zero Day Initiative Advisory ZDI 16-241: (0Day) Apple QuickTime moov Atom Heap Corruption Remote Code Execution Vulnerabilit</a></li>\n\t\t\t\t\t<li><a href=\"https://www.zerodayinitiative.com/advisories/ZDI-16-242/\">[3] Zero Day Initiative Advisory ZDI 16-242: (0Day) Apple QuickTime Atom Processing Heap Corruption Remote Code Execution Vulner</a></li>\n\t\t\t\t\t<li><a href=\"https://support.apple.com/en-us/HT205771\">[4] Apple - Uninstall QuickTime 7 for Windows</a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>April 14, 2016: Initial Release</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Thu, 14 Apr 2016 19:48:28 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"6472 at https://www.us-cert.gov"}},{"title":"TA16-091A: Ransomware and Recent Variants","link":"https://www.us-cert.gov/ncas/alerts/TA16-091A","description":"\n\n\t\tOriginal release date: March 31, 2016 | Last revised: September 29, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<p>Networked Systems</p>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>In early 2016, destructive ransomware variants such as Locky and Samas were observed infecting computers belonging to individuals and businesses, which included healthcare facilities and hospitals worldwide. Ransomware is a type of malicious software that infects a computer and restricts users’ access to it until a ransom is paid to unlock it.</p><p>The United States Department of Homeland Security (DHS), in collaboration with Canadian Cyber Incident Response Centre (CCIRC), is releasing this Alert to provide further information on ransomware, specifically its main characteristics, its prevalence, variants that may be proliferating, and how users can prevent and mitigate against ransomware.</p>\t\t\n\t\t<h3>Description</h3>\n\t\t<h4><strong>WHAT IS RANSOMWARE?</strong></h4><p>Ransomware is a type of malware that infects computer systems, restricting users’ access to the infected systems. Ransomware variants have been observed for several years and often attempt to extort money from victims by displaying an on-screen alert. Typically, these alerts state that the user’s systems have been locked or that the user’s files have been encrypted. Users are told that unless a ransom is paid, access will not be restored. The ransom demanded from individuals varies greatly but is frequently $200–$400 dollars and must be paid in virtual currency, such as Bitcoin.</p><p>Ransomware is often spread through phishing emails that contain malicious attachments or through drive-by downloading. Drive-by downloading occurs when a user unknowingly visits an infected website and then malware is downloaded and installed without the user’s knowledge.</p><p>Crypto ransomware, a malware variant that encrypts files, is spread through similar methods and has also been spread through social media, such as Web-based instant messaging applications. Additionally, newer methods of ransomware infection have been observed. For example, vulnerable Web servers have been exploited as an entry point to gain access into an organization’s network.</p><h4><strong>WHY IS IT SO EFFECTIVE?</strong></h4><p>The authors of ransomware instill fear and panic into their victims, causing them to click on a link or pay a ransom, and users systems can become infected with additional malware. Ransomware displays intimidating messages similar to those below:</p><ul><li>“Your computer has been infected with a virus. Click here to resolve the issue.”</li><li>“Your computer was used to visit websites with illegal content. To unlock your computer, you must pay a $100 fine.”</li><li>“All files on your computer have been encrypted. You must pay this ransom within 72 hours to regain access to your data.”</li></ul><h4><strong>PROLIFERATION OF VARIANTS</strong></h4><p>In 2012, Symantec, using data from a command and control (C2) server of 5,700 computers compromised in one day, estimated that approximately 2.9 percent of those compromised users paid the ransom. With an average ransom of $200, this meant malicious actors profited $33,600 per day, or $394,400 per month, from a single C2 server. These rough estimates demonstrate how profitable ransomware can be for malicious actors.</p><p>This financial success has likely led to a proliferation of ransomware variants. In 2013, more destructive and lucrative ransomware variants were introduced, including Xorist, CryptorBit, and <a href=\"https://www.us-cert.gov/ncas/alerts/TA13-309A\">CryptoLocker</a>. Some variants encrypt not just the files on the infected device, but also the contents of shared or networked drives. These variants are considered destructive because they encrypt users’ and organizations’ files, and render them useless until criminals receive a ransom.</p><p>In early 2016, a destructive ransomware variant, Locky, was observed infecting computers belonging to healthcare facilities and hospitals in the United States, New Zealand, and Germany. It propagates through spam emails that include malicious Microsoft Office documents or compressed attachments (e.g., .rar, .zip). The malicious attachments contain macros or JavaScript files to download Ransomware-Locky files.</p><p>Samas, another variant of destructive ransomware, was used to compromise the networks of healthcare facilities in 2016. Unlike Locky, Samas propagates through vulnerable Web servers. After the Web server was compromised, uploaded Ransomware-Samas files were used to infect the organization’s networks.</p><h4><strong>LINKS TO OTHER TYPES OF MALWARE</strong></h4><p>Systems infected with ransomware are also often infected with other malware. In the case of CryptoLocker, a user typically becomes infected by opening a malicious attachment from an email. This malicious attachment contains Upatre, a downloader, which infects the user with <a href=\"https://www.us-cert.gov/ncas/alerts/TA14-150A\">GameOver Zeus</a>. GameOver Zeus is a variant of the Zeus Trojan that steals banking information and is also used to steal other types of data. Once a system is infected with GameOver Zeus, Upatre will also download CryptoLocker. Finally, CryptoLocker encrypts files on the infected system, and requests that a ransom be paid.</p><p>The close ties between ransomware and other types of malware were demonstrated through the recent botnet disruption operation against GameOver Zeus, which also proved effective against CryptoLocker. In June 2014, an international law enforcement operation successfully weakened the infrastructure of both GameOver Zeus and CryptoLocker.</p>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>Ransomware not only targets home users; businesses can also become infected with ransomware, leading to negative consequences, including</p><ul><li>temporary or permanent loss of sensitive or proprietary information,</li><li>disruption to regular operations,</li><li>financial losses incurred to restore systems and files, and</li><li>potential harm to an organization’s reputation.</li></ul><p>Paying the ransom does not guarantee the encrypted files will be released; it only guarantees that the malicious actors receive the victim’s money, and in some cases, their banking information. In addition, decrypting files does not mean the malware infection itself has been removed.</p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<p>Infections can be devastating to an individual or organization, and recovery can be a difficult process that may require the services of a reputable data recovery specialist.</p><p>US-CERT recommends that users and administrators take the following preventive measures to protect their computer networks from ransomware infection:</p><ul><li>Employ a data backup and recovery plan for all critical information. Perform and test regular backups to limit the impact of data or system loss and to expedite the recovery process. Note that network-connected backups can also be affected by ransomware; critical backups should be isolated from the network for optimum protection.</li><li>Use application whitelisting to help prevent malicious software and unapproved programs from running. Application whitelisting is one of the best security strategies as it allows only specified programs to run, while blocking all others, including malicious software.</li><li>Keep your operating system and software up-to-date with the latest patches. Vulnerable applications and operating systems are the target of most attacks. Ensuring these are patched with the latest updates greatly reduces the number of exploitable entry points available to an attacker.</li><li>Maintain up-to-date anti-virus software, and scan all software downloaded from the internet prior to executing.</li><li>Restrict users’ ability (permissions) to install and run unwanted software applications, and apply the principle of “Least Privilege” to all systems and services. Restricting these privileges may prevent malware from running or limit its capability to spread through the network.</li><li>Avoid enabling macros from email attachments. If a user opens the attachment and enables macros, embedded code will execute the malware on the machine. For enterprises or organizations, it may be best to block email messages with attachments from suspicious sources. For information on safely handling email attachments, see <a href=\"https://www.us-cert.gov/sites/default/files/publications/emailscams_0905.pdf\">Recognizing and Avoiding Email Scams</a>. Follow safe practices when browsing the Web. See <a href=\"https://www.us-cert.gov/ncas/tips/ST04-003\">Good Security Habits</a> and <a href=\"https://www.us-cert.gov/ncas/tips/ST06-008\">Safeguarding Your Data</a> for additional details.</li><li>Do not follow unsolicited Web links in emails. Refer to the US-CERT Security Tip on <a href=\"https://www.us-cert.gov/ncas/tips/ST04-014\">Avoiding Social Engineering and Phishing Attacks</a> or the Security Publication on <a href=\"https://www.us-cert.gov/security-publications/Ransomware\">Ransomware</a> for more information.</li></ul><p>Individuals or organizations are discouraged from paying the ransom, as this does not guarantee files will be released. Report instances of fraud to the FBI at the <a href=\"https://www.ic3.gov/\">Internet Crime Complaint Center</a>.</p>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"http://www.kaspersky.com/au/about/news/virus/2014/Kaspersky-Lab-detects-mobile-Trojan-Svpeng-Financial-malware-with-ransomware-capabilities-now-targeting-US-users\">Kaspersky Lab, Kaspersky Lab detects mobile Trojan Svpeng: Financial malware with ransomware capabilities now targeting U.S.</a></li>\n\t\t\t\t\t<li><a href=\"https://nakedsecurity.sophos.com/2014/06/18/whats-next-for-ransomware-cryptowall-picks-up-where-cryptolocker-left-off/\">Sophos / Naked Security, What’s next for ransomware? CryptoWall picks up where CryptoLocker left off</a></li>\n\t\t\t\t\t<li><a href=\"https://www.symantec.com/connect/blogs/cryptodefense-cryptolocker-imitator-makes-over-34000-one-month\">Symantec, CryptoDefence, the CryptoLocker Imitator, Makes Over $34,000 in One Month</a></li>\n\t\t\t\t\t<li><a href=\"https://www.symantec.com/connect/blogs/cryptolocker-thriving-menace\">Symantec, Cryptolocker: A Thriving Menace</a></li>\n\t\t\t\t\t<li><a href=\"https://www.symantec.com/connect/blogs/cryptolocker-qa-menace-year\">Symantec, Cryptolocker Q&amp;A: Menace of the Year</a></li>\n\t\t\t\t\t<li><a href=\"https://www.symantec.com/connect/blogs/international-takedown-wounds-gameover-zeus-cybercrime-network\">Symantec, International Takedown Wounds Gameover Zeus Cybercrime Network</a></li>\n\t\t\t\t\t<li><a href=\"https://nakedsecurity.sophos.com/2016/02/17/locky-ransomware-what-you-need-to-know/\">Sophos / Naked Security, “Locky” ransomware – what you need to know</a></li>\n\t\t\t\t\t<li><a href=\"https://kc.mcafee.com/resources/sites/MCAFEE/content/live/PRODUCT_DOCUMENTATION/26000/PD26383/en_US/McAfee_Labs_Threat_Advisory-Ransomware-Locky.pdf\">McAfee Labs Threat Advisory: Ransomware-Locky. March 9, 2016</a></li>\n\t\t\t\t\t<li><a href=\"https://blogs.cisco.com/security/talos/samsam-the-doctor-will-see-you-after-he-pays-the-ransom\">SamSam: The Doctor Will See You, After He Pays The Ransom</a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>March 31, 2016: Initial publication</li>\n\t\t\t\t\t\t<li>May 6, 2016: Clarified guidance on offline backups</li>\n\t\t\t\t\t\t<li>July 11, 2016: Added link to governmental interagency guidance on ransomware</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Thu, 31 Mar 2016 22:00:00 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"6454 at https://www.us-cert.gov"}},{"title":"TA15-337A: Dorkbot","link":"https://www.us-cert.gov/ncas/alerts/TA15-337A","description":"\n\n\t\tOriginal release date: December 03, 2015 | Last revised: September 29, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<p>Microsoft Windows</p>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>Dorkbot is a botnet used to steal online payment, participate in distributed denial-of-service (DDoS) attacks, and deliver other types of malware to victims’ computers. According to Microsoft, the family of malware used in this botnet “has infected more than one million personal computers in over 190 countries over the course of the past year.” The United States Department of Homeland Security (DHS), in collaboration with the Federal Bureau of Investigation (FBI) and Microsoft, is releasing this Technical Alert to provide further information about Dorkbot.</p>\t\t\n\t\t<h3>Description</h3>\n\t\t<p>Dorkbot-infected systems are used by cyber criminals to steal sensitive information (such as user account credentials), launch denial-of-service (DoS) attacks, disable security protection, and distribute several malware variants to victims’ computers. Dorkbot is commonly spread via malicious links sent through social networks instant message programs or through infected USB devices.</p><p>In addition, Dorkbot’s backdoor functionality allows a remote attacker to exploit infected system. According to Microsoft’s analysis, a remote attacker may be able to:</p><ul><li>Download and run a file from a specified URL;</li><li>Collect logon information and passwords through form grabbing, FTP, POP3, or Internet Explorer and Firefox cached login details; or</li><li>Block or redirect certain domains and websites (e.g., security sites).</li></ul>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>A system infected with Dorkbot may be used to send spam, participate in DDoS attacks, or harvest users' credentials for online services, including banking services.</p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<p>Users are advised to take the following actions to remediate Dorkbot infections:</p><ul><li><em>Use and maintain anti-virus software</em> – Anti-virus software recognizes and protects your computer against most known viruses. Even though Dorkbot is designed to evade detection, security companies are continuously updating their software to counter these advanced threats. Therefore, it is important to keep your anti-virus software up-to-date. If you suspect you may be a victim of Dorkbot, update your anti-virus software definitions and run a full-system scan. (See <a href=\"https://www.us-cert.gov/ncas/tips/ST04-005\">Understanding Anti-Virus Software</a> for more information.)</li><li><em>Change your passwords</em> – Your original passwords may have been compromised during the infection, so you should change them. (See <a href=\"https://www.us-cert.gov/ncas/tips/ST04-002\">Choosing and Protecting Passwords</a> for more information.)</li><li><em>Keep your operating system and application software up-to-date</em> – Install software patches so that attackers cannot take advantage of known problems or vulnerabilities. You should enable automatic updates of the operating system if this option is available. (See <a href=\"https://www.us-cert.gov/ncas/tips/ST04-006\">Understanding Patches</a> for more information.)</li><li><em>Use anti-malware tools</em> – Using a legitimate program that identifies and removes malware can help eliminate an infection. Users can consider employing a remediation tool (see example below) to help remove Dorkbot from their systems.</li><li><em>Disable Autorun­ – </em>Dorkbot tries to use the Windows Autorun function to propagate via removable drives (e.g., USB flash drive). You can disable Autorun to stop the threat from spreading.</li></ul><h4><strong>Microsoft</strong></h4><p><a href=\"https://www.microsoft.com/security/scanner/en-us/default.aspx\">https://www.microsoft.com/security/scanner/en-us/default.aspx</a></p><p>The above example does not constitute an exhaustive list. The U.S. Government does not endorse or support any particular product or vendor.</p>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"https://www.microsoft.com/security/portal/threat/encyclopedia/entry.aspx?Name=Worm%3AWin32/Dorkbot#tab=2\">Microsoft Malware Protection Center – Worm: Win32/Dorkbot</a></li>\n\t\t\t\t\t<li><a href=\"https://blogs.technet.com/b/mmpc/archive/2015/12/03/microsoft-assists-law-enforcement-to-help-disrupt-dorkbot-botnets.aspx\">Microsoft Malware Protection Center – Microsoft assists law enforcement to help disrupt Dorkbot botnets</a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>December 3, 2015: Initial Publication</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Thu, 03 Dec 2015 23:40:41 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"6343 at https://www.us-cert.gov"}},{"title":"TA15-314A: Compromised Web Servers and Web Shells - Threat Awareness and Guidance","link":"https://www.us-cert.gov/ncas/alerts/TA15-314A","description":"\n\n\t\tOriginal release date: November 10, 2015 | Last revised: September 29, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<p>Compromised web servers with malicious web shells installed</p>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>This alert describes the frequent use of web shells as an exploitation vector. Web shells can be used to obtain unauthorized access and can lead to wider network compromise. This alert outlines the threat and provides prevention, detection, and mitigation strategies.</p><p>Consistent use of web shells by Advanced Persistent Threat (APT) and criminal groups has led to significant cyber incidents.</p><p>This product was developed in collaboration with US-CERT partners in the United Kingdom, Australia, Canada, and New Zealand based on activity seen targeting organizations across these countries. The detection and mitigation measures outlined in this document represent the shared judgement of all participating agencies.</p>\t\t\n\t\t<h3>Description</h3>\n\t\t<h4><strong>W</strong><strong>e</strong><strong>b Shell Description</strong></h4><p>A web shell is a script that can be uploaded to a web server to enable remote administration of the machine. Infected web servers can be either Internet-facing or internal to the network, where the web shell is used to pivot further to internal hosts.</p><p>A web shell can be written in any language that the target web server supports. The most commonly observed web shells are written in languages that are widely supported, such as PHP and ASP. Perl, Ruby, Python, and Unix shell scripts are also used.</p><p>Using network reconnaissance tools, an adversary can identify vulnerabilities that can be exploited and result in the installation of a web shell. For example, these vulnerabilities can exist in content management systems (CMS) or web server software.</p><p>Once successfully uploaded, an adversary can use the web shell to leverage other exploitation techniques to escalate privileges and to issue commands remotely. These commands are directly linked to the privilege and functionality available to the web server and may include the ability to add, delete, and execute files as well as the ability to run shell commands, further executables, or scripts.</p><h4><strong>How and why are they used by malicious adversaries?</strong></h4><p>Web shells are frequently used in compromises due to the combination of remote access and functionality. Even simple web shells can have a considerable impact and often maintain minimal presence.</p><p>Web shells are utilized for the following purposes:</p><ol><li>To harvest and exfiltrate sensitive data and credentials;</li><li>To upload additional malware for the potential of creating, for example, a watering hole for infection and scanning of further victims;</li><li>To use as a relay point to issue commands to hosts inside the network without direct Internet access;</li><li>To use as command-and-control infrastructure, potentially in the form of a bot in a botnet or in support of compromises to additional external networks. This could occur if the adversary intends to maintain long-term persistence.</li></ol><p>While a web shell itself would not normally be used for denial of service (DoS) attacks, it can act as a platform for uploading further tools, including DoS capability.</p><h4><strong>E</strong><strong>xamples</strong></h4><p>Web shells such as China Chopper, WSO, C99 and B374K are frequently chosen by adversaries; however these are just a small number of known used web shells. (Further information linking to IOCs and SNORT rules can be found in the Additional Resources section).</p><ul><li><strong><em>China Chopper </em></strong><em>– </em>A small web shell packed with features. Has several command and control features including a password brute force capability.</li><li><strong><em>W</em></strong><strong><em>S</em></strong><strong><em>O </em></strong><em>– </em>Stands for “web shell by orb” and has the ability to masquerade as an error page containing a hidden login form.</li><li><strong><em>C99 </em></strong><em>– </em>A version of the WSO shell with additional functionality. Can display the server’s security measures and contains a self-delete function.</li><li><strong><em>B374K </em></strong><em>– </em>PHP based web shell with common functionality such as viewing processes and executing commands.</li></ul><h4><strong>Delivery Tactics</strong></h4><p>Web shells can be delivered through a number of web application exploits or configuration weaknesses including:</p><ul><li>Cross-Site Scripting;</li><li>SQL Injection;</li><li>Vulnerabilities in applications/services  (e.g., WordPress or other CMS applications);</li><li>File processing vulnerabilities (e.g., upload filtering or assigned permissions);</li><li>Remote File Include (RFI) and Local File Include (LFI) vulnerabilities;</li><li>Exposed Admin Interfaces (possible areas to find vulnerabilities mentioned above).</li></ul><p>The above tactics can be and are combined regularly. For example, an exposed admin interface also requires a file upload option, or another exploit method mentioned above, to deliver successfully.</p>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>A successfully uploaded shell script may allow a remote attacker to bypass security restrictions and gain unauthorized system access.</p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<h4><strong>Prevention and Mitigation</strong></h4><p>Installation of a web shell is commonly accomplished through web application vulnerabilities or configuration weaknesses. Therefore, identification and closure of these vulnerabilities is crucial to avoiding potential compromise. The following suggestions specify good security and web shell specific practices:</p><ul><li>Employ regular updates to applications and the host operating system to ensure protection against known vulnerabilities.</li><li>Implement a least-privileges policy on the web server to:<ul><li>Reduce adversaries’ ability to escalate privileges or pivot laterally to other hosts.</li><li>Control creation and execution of files in particular directories.</li></ul></li><li>If not already present, consider deploying a demilitarized zone (DMZ) between your webfacing systems and the corporate network. Limiting the interaction and logging traffic between the two provides a method to identify possible malicious activity.</li><li>Ensure a secure configuration of web servers. All unnecessary services and ports should be disabled or blocked. All necessary services and ports should be restricted where feasible. This can include whitelisting or blocking external access to administration panels and not using default login credentials.</li><li>Utilize a reverse proxy or alternative service, such as mod_security, to restrict accessible URL paths to known legitimate ones.</li><li>Establish, and backup offline, a “known good” version of the relevant server and a regular change-management  policy to enable monitoring for changes to servable content with a file integrity system.</li><li>Employ user input validation to restrict local and remote file inclusion vulnerabilities.</li><li>Conduct regular system and application vulnerability scans to establish areas of risk. While this method does not protect against zero day attacks it will highlight possible areas of concern.</li><li>Deploy a web application firewall and conduct regular virus signature checks, application fuzzing, code reviews and server network analysis.</li></ul><h4><strong>Detection</strong></h4><p>Due to the potential simplicity and ease of modification of web shells, they can be difficult to detect. For example, anti-virus products sometimes produce poor results in detecting web shells.</p><p>The following may be indicators that your system has been infected by a web shell. Note a number of these indicators are common to legitimate files. Any suspected malicious files should be considered in the context of other indicators and triaged to determine whether further inspection or validation is required.</p><ul><li>Abnormal periods of high site usage (due to potential uploading and downloading activity);</li><li>Files with an unusual timestamp (e.g., more recent than the last update of the web applications installed);</li><li>Suspicious files in Internet-accessible locations (web root);</li><li>Files containing references to suspicious keywords such as cmd.exe or eval;</li><li>Unexpected connections in logs. For example:<ul><li>A file type generating unexpected or anomalous network traffic (e.g., a JPG file making requests with POST parameters);</li><li>Suspicious logins originating from internal subnets to DMZ servers and vice versa.</li></ul></li><li>Any evidence of suspicious shell commands, such as directory traversal, by the web server process.<span id=\"cke_bm_424E\" style=\"display: none;\"> </span></li></ul><p>For investigating many types of shells, a search engine can be very helpful. Often, web shells will be used to spread malware onto a server and the search engines are able to see it. But many web shells check the User-Agent and will display differently for a search engine spider (a program that crawls through links on the Internet, grabbing content from sites and adding it to search engine indexes) than for a regular user. To find a shell, you may need to change your User-Agent to one of the search engine bots. Some browsers have plugins that allow you to easily switch a User-Agent. Once the shell is detected, simply delete the file from the server.</p><p>Client characteristics can also indicate possible web shell activity. For example, the malicious actor will often visit only the URI where the web shell script was created, but a standard user usually loads the webpage from a linked page/referrer or loads additional content/resources. Thus, performing frequency analysis on the web access logs could indicate the location of a web shell. Most legitimate URI visits will contain varying user-agents, whereas a web shell is generally only visited by the creator, resulting in limited user-agent variants.</p>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"http://asd.gov.au/publications/protect/securing-cms.htm\">Australian Cyber Security Centre – Securing Content Management Systems (CMS)</a></li>\n\t\t\t\t\t<li><a href=\"https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-china-chopper.pdf\">FireEye China Chopper – The Little Malware That Could. Detecting and Defeating the China Chopper Web Shell</a></li>\n\t\t\t\t\t<li><a href=\"https://www.owasp.org/images/c/c3/ASDC12-Old_Webshells_New_Tricks_How_Persistent_Threats_haverevived_an_old_idea_and_how_you_can_detect_them.pdf\">MANDIANT  – Old Web Shells New Tricks</a></li>\n\t\t\t\t\t<li><a href=\"https://www.fireeye.com/blog/threat-research/2013/08/breaking-down-the-china-chopper-web-shell-part-i.html\">FireEye – Breaking Down the China Chopper Web Shell Part I</a></li>\n\t\t\t\t\t<li><a href=\"https://www.fireeye.com/blog/threat-research/2013/08/breaking-down-the-china-chopper-web-shell-part-ii.html\">FireEye – Breaking Down the China Chopper Web Shell Part II</a></li>\n\t\t\t\t\t<li><a href=\"http://www.stratigery.com/phparasites/wso.html\">WSO Information </a></li>\n\t\t\t\t\t<li><a href=\"https://www.exploit-db.com/docs/27654.pdf\">Exploit-db – China Chopper</a></li>\n\t\t\t\t\t<li><a href=\"http://www.cybersecurity.me/ids-intrusion-detection-systems-snort-bro/snort-ids-intrusiondetection-system/snort-signatures-rules-to-detect-webshells-c99-c99shell-and-more/\">C99</a></li>\n\t\t\t\t\t<li><a href=\"https://Resources.infosecinstitute.com/web-shell-detection/\">INFOSEC Institute – Web Shell Detection</a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>November 10, 2015: Initial Release</li>\n\t\t\t\t\t\t<li>November 13, 2015: Changes to Title and Systems Affected sections</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Wed, 11 Nov 2015 01:12:08 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"6311 at https://www.us-cert.gov"}},{"title":"TA15-286A: Dridex P2P Malware","link":"https://www.us-cert.gov/ncas/alerts/TA15-286A","description":"\n\n\t\tOriginal release date: October 13, 2015 | Last revised: September 29, 2016<br />\n\t\t<h3>Systems Affected</h3>\n\t\t<p>Microsoft Windows</p>\t\t\n\t\t<h3>Overview</h3>\n\t\t<p>Dridex, a peer-to-peer (P2P) bank credential-stealing malware, uses a decentralized network infrastructure of compromised personal computers and web servers to execute command-and-control (C2). The United States Department of Homeland Security (DHS), in collaboration with the Federal Bureau of Investigation (FBI) and the Department of Justice (DOJ), is releasing this Technical Alert to provide further information about the Dridex botnet.</p>\t\t\n\t\t<h3>Description</h3>\n\t\t<p>Dridex is a multifunctional malware package that leverages obfuscated macros in Microsoft Office and extensible markup language (XML) files to infect systems. The primary goal of Dridex is to infect computers, steal credentials, and obtain money from victims’ bank accounts. Operating primarily as a banking Trojan, Dridex is generally distributed through phishing email messages. The emails appear legitimate and are carefully crafted to entice the victim to click on a hyperlink or to open a malicious attached file. Once a computer has been infected, Dridex is capable of stealing user credentials through the use of surreptitious keystroke logging and web injects.</p>\t\t\n\t\t<h3>Impact</h3>\n\t\t<p>A system infected with Dridex may be employed to send spam, participate in distributed denial-of-service (DDoS) attacks, and harvest users' credentials for online services, including banking services.</p>\t\t\n\t\t<h3>Solution</h3>\n\t\t<p>Users are recommended to take the following actions to remediate Dridex infections:</p><ul><li><em>Use and maintain anti-virus software</em> - Anti-virus software recognizes and protects your computer against most known viruses. Even though Dridex is designed to evade detection, security companies are continuously updating their software to counter these advanced threats. Therefore, it is important to keep your anti-virus software up-to-date (see <a href=\"https://www.us-cert.gov/ncas/tips/ST04-005\">Understanding Anti-Virus Software</a> for more information).</li><li><em>Change your passwords</em> - Your original passwords may have been compromised during the infection, so you should change them (see <a href=\"https://www.us-cert.gov/ncas/tips/ST04-002\">Choosing and Protecting Passwords</a> for more information).</li><li><em>Keep your operating system and application software up-to-date</em> - Install software patches so that attackers can't take advantage of known problems or vulnerabilities. Many operating systems offer automatic updates. You should enable automatic updates if this option is available (see <a href=\"https://www.us-cert.gov/ncas/tips/ST04-006\">Understanding Patches</a> for more information).</li><li><em>Use anti-malware tools</em> - Using a legitimate program that identifies and removes malware can help eliminate an infection. Users can consider employing a remediation tool (examples below) to help remove Dridex from your system.</li></ul><p><strong>       F-Secure</strong></p><p>       <a href=\"https://www.f-secure.com/en/web/home_global/online-scanner\">https://www.f-secure.com/en/web/home_global/online-scanner</a></p><p>       <strong>McAfee</strong></p><p>       <a href=\"https://www.mcafee.com/uk/downloads/free-tools/stinger.aspx\">https://www.mcafee.com/uk/downloads/free-tools/stinger.aspx</a></p><p>       <strong>Microsoft</strong></p><p>       <a href=\"https://www.microsoft.com/security/scanner/en-us/default.aspx\">https://www.microsoft.com/security/scanner/en-us/default.aspx</a></p><p>       <strong>Sophos</strong></p><p>       <a href=\"https://www.sophos.com/en-us/products/free-tools/virus-removal-tool.aspx\">https://www.sophos.com/en-us/products/free-tools/virus-removal-tool.aspx</a></p><p>       <strong>Trend Micro</strong></p><p>       <a href=\"http://housecall.trendmicro.com/\">http://housecall.trendmicro.com/</a></p><p>The above are examples only and do not constitute an exhaustive list. The U.S. Government does not endorse or support any particular product or vendor.</p>\t\t\n\t\t<h3>References</h3>\n\t\t<ul>\n\t\t\t\t\t<li><a href=\"\">N/A</a></li>\n\t\t\t\t</ul>\n\t\t\n\t\t<h3>Revision History</h3>\n\t\t<ul>\n\t\t\t\t\t<li>Initial Publication - October 13, 2015</li>\n\t\t\t\t\t</ul>\n\t\t<hr />\n\t\t<p>This product is provided subject to this <a href=\"http://www.us-cert.gov/privacy/notification\">Notification</a> and this <a href=\"http://www.us-cert.gov/privacy/\">Privacy &amp; Use</a> policy.</p>\t\t<br />\n\t","pubDate":"Tue, 13 Oct 2015 11:23:04 +0000","creator":{"__prefix":"dc","__text":"US-CERT"},"guid":{"_isPermaLink":"false","__text":"6273 at https://www.us-cert.gov"}}]},"_version":"2.0","_xml:base":"https://www.us-cert.gov/ncas/alerts.xml","_xmlns:dc":"http://purl.org/dc/elements/1.1/","_xmlns:atom":"http://www.w3.org/2005/Atom"}}