{"article" :{"_id":"5834c075fc672bf473eecd2b","slug":"google-analytics","sortOrder":110,"title":"Google Analytics","categories":[],"state":"published","__v":0,"content":{"brief":"<p>Cyber.gov participates in the U.S. Digital Analytics Program, (DAP) which utilizes a unified Google Analytics account for Federal agencies. This program helps Federal agencies understand how people find, access, and use government services online.</p>\r\n<p>The DAP is a hosted shared service provided by the General Services Administration&rsquo;s (GSA&rsquo;s) Office of Citizen Services and Innovative Technologies, and the protocol and information collected are the same for all websites participating in the DAP. As a participant in GSA&rsquo;s DAP program, this website&rsquo;s Google Analytics traffic data is automatically reported to GSA.</p>\r\n<p>Google Analytics is a third-party web measurement and customization technology as defined in OMB M-10-22.</p>\r\n<p>Here is how it works: Google Analytics sets one or more cookies on your computer so that it can recognize your computer if you visit the Cyber.gov website in the future. These cookies do not collect personally identifiable information. This is considered a Tier 2 usage, as defined in the OMB guidance.</p>\r\n<p>Google Analytics does not collect personally identifiable information through its cookies. The program does not track individuals and anonymizes the IP addresses of visitors. Common Questions about DAP (FAQ) provides more information about how IP addresses are anonymized. According to GSA&rsquo;s Common Questions About DAP, &ldquo;none of the federal government data tracked as part of the Data Analytics Program will be shared with or available to Google&rsquo;s corporate advertising partners.&rdquo;</p>\r\n<p>A limited number of authorized individuals will have user accounts that will allow them to log in to the Google Analytics dashboard and view or run reports regarding visits to Cyber.gov and the other web metrics available from the DAP.</p>\r\n<p>Visitors who choose to disable this web measurement tool will still have full access to Cyber.gov. While the details vary from browser to browser, most modern browsers can be set up to accept, reject, or request user intervention when a site asks to set a cookie.</p>\r\n<p>You can view web metrics information at&nbsp;<a href=\"https://analytics.usa.gov/\">analytics.usa.gov</a>.</p>","extended":""},"controller":"","headerTemplate":"","template":"","url":"","source":"","subtitle":"","author":{"$oid":"57ffa09e912367363e03a5b5"},"publishedDate":{"$date":"2016-12-20T00:00:00.000-0800"}}}