{"section" :{"_id":"580bf566073cc11219b15e57","slug":"cybersecurity-national-action-plan","sortOrder":6,"title":"Cybersecurity National Action Plan","sections":[],"articles":[{"$oid":"581b84d90c877d604f001763"},{"$oid":"581cf618aa5502a86a4a43de"}],"__v":2,"author":{"$oid":"57ffa09e912367363e03a5b5"},"content":{"brief":"","extended":"","micro":"<p><em>Taking bold actions to protect Americans in today&rsquo;s digital world.&nbsp;</em></p>\r\n<p>From buying products to running businesses to finding directions to communicating with the people we love, an online world has fundamentally reshaped our daily lives. &nbsp;But just as the continually evolving digital age presents boundless opportunities for our economy, our businesses, and our people, it also presents a new generation of threats that we must adapt to meet. &nbsp;Criminals, terrorists, and countries who wish to do us harm have all realized that attacking us online is often easier than attacking us in person. &nbsp;As more and more sensitive data is stored online, the consequences of those attacks grow more significant each year. &nbsp;</p>\r\n<p>Meeting these new threats is necessary and within our grasp. &nbsp;But it requires a bold reassessment of the way we approach security in the digital age. &nbsp;If we&rsquo;re going to be connected, we need to be protected. &nbsp;We need to join together&mdash;Government, businesses, and individuals&mdash;to sustain the spirit that has always made America great.&nbsp;</p>\r\n<p><em>The Cybersecurity National Action Plan (CNAP) is the capstone of more than seven years of determined effort, building upon lessons learned from cybersecurity trends, threats, and intrusions. &nbsp;This plan directs the Federal Government to take bold action and fosters the conditions required for long-term improvements in our approach to cybersecurity across the Federal Government, the private sector, and our personal lives.&nbsp;</em></p>"},"controller":"","headerTemplate":"","template":""}}